window.onload = function() {
 if ($("select[name='departure_city']").val() == "Любой") {
$("select[name='departure_city']").empty();

        if ($("select[name='departure_country']").val() == "RU") {
            data = {
                "Абакан": "Абакан",
                "Анапа": "Анапа",
                "Архангельск": "Архангельск",
                "Астрахань": "Астрахань",
                "Барнаул": "Барнаул",
                "Белгород": "Белгород",
                "Благовещенск": "Благовещенск",
                "Братск": "Братск",
                "Брянск": "Брянск",
                "Владивосток": "Владивосток",
                "Владикавказ": "Владикавказ",
                "Волгоград": "Волгоград",
                "Воронеж": "Воронеж",
                "Грозный": "Грозный",
                "Екатеринбург": "Екатеринбург",
                "Иваново": "Иваново",
                "Ижевск": "Ижевск",
                "Иркутск": "Иркутск",
                "Казань": "Казань",
                "Калининград": "Калининград",
                "Калуга": "Калуга",
                "Кемерово": "Кемерово",
                "Киров": "Киров",
                "Краснодар": "Краснодар",
                "Красноярск": "Красноярск",
                "Курск": "Курск",
                "Липецк": "Липецк",
                "Магнитогорск": "Магнитогорск",
                "Махачкала": "Махачкала",
                "Мин.Воды": "Мин.Воды",
                "Москва": "Москва",
                "Мурманск": "Мурманск",
                "Н.Новгород": "Н.Новгород",
                "Наб.Челны": "Наб.Челны",
                "Нальчик": "Нальчик",
                "Нижневартовск": "Нижневартовск",
                "Нижнекамск": "Нижнекамск",
                "Новокузнецк": "Новокузнецк",
                "Новосибирск": "Новосибирск",
                "Новый Уренгой": "Новый Уренгой",
                "Омск": "Омск",
                "Оренбург": "Оренбург",
                "Орск": "Орск",
                "П.Камчатский": "П.Камчатский",
                "Пенза": "Пенза",
                "Пермь": "Пермь",
                "Ростов-на-Дону": "Ростов-на-Дону",
                "С.Петербург": "С.Петербург",
                "Самара": "Самара",
                "Саранск": "Саранск",
                "Саратов": "Саратов",
                "Симферополь": "Симферополь",
                "Сочи": "Сочи",
                "Ставрополь": "Ставрополь",
                "Сургут": "Сургут",
                "Сыктывкар": "Сыктывкар",
                "Томск": "Томск",
                "Тюмень": "Тюмень",
                "Улан-Удэ": "Улан-Удэ",
                "Ульяновск": "Ульяновск",
                "Уфа": "Уфа",
                "Хабаровск": "Хабаровск",
                "Ханты-Мансийск": "Ханты-Мансийск",
                "Чебоксары": "Чебоксары",
                "Челябинск": "Челябинск",
                "Череповец": "Череповец",
                "Чита": "Чита",
                "Ю.Сахалинск": "Ю.Сахалинск",
                "Якутск": "Якутск",
                "Ярославль": "Ярославль"
            };
            def = "Москва";
        };
        for(var id in data) {
            if (id == def) {
                $("select[name='departure_city']").append($("<option selected value='" + id + "'>" + data[id] + "</option>"));
            } else {
                $("select[name='departure_city']").append($("<option value='" + id + "'>" + data[id] + "</option>"));
            };
        };
    };
};

$(document).ready (function () {
    $("select[name='departure_country']").bind("change", function () {
        $("select[name='departure_city']").empty();

        if ($("select[name='departure_country']").val() == "RU") {
            data = {
                "Абакан": "Абакан",
                "Анапа": "Анапа",
                "Архангельск": "Архангельск",
                "Астрахань": "Астрахань",
                "Барнаул": "Барнаул",
                "Белгород": "Белгород",
                "Благовещенск": "Благовещенск",
                "Братск": "Братск",
                "Брянск": "Брянск",
                "Владивосток": "Владивосток",
                "Владикавказ": "Владикавказ",
                "Волгоград": "Волгоград",
                "Воронеж": "Воронеж",
                "Грозный": "Грозный",
                "Екатеринбург": "Екатеринбург",
                "Иваново": "Иваново",
                "Ижевск": "Ижевск",
                "Иркутск": "Иркутск",
                "Казань": "Казань",
                "Калининград": "Калининград",
                "Калуга": "Калуга",
                "Кемерово": "Кемерово",
                "Киров": "Киров",
                "Краснодар": "Краснодар",
                "Красноярск": "Красноярск",
                "Курск": "Курск",
                "Липецк": "Липецк",
                "Магнитогорск": "Магнитогорск",
                "Махачкала": "Махачкала",
                "Мин.Воды": "Мин.Воды",
                "Москва": "Москва",
                "Мурманск": "Мурманск",
                "Н.Новгород": "Н.Новгород",
                "Наб.Челны": "Наб.Челны",
                "Нальчик": "Нальчик",
                "Нижневартовск": "Нижневартовск",
                "Нижнекамск": "Нижнекамск",
                "Новокузнецк": "Новокузнецк",
                "Новосибирск": "Новосибирск",
                "Новый Уренгой": "Новый Уренгой",
                "Омск": "Омск",
                "Оренбург": "Оренбург",
                "Орск": "Орск",
                "П.Камчатский": "П.Камчатский",
                "Пенза": "Пенза",
                "Пермь": "Пермь",
                "Ростов-на-Дону": "Ростов-на-Дону",
                "С.Петербург": "С.Петербург",
                "Самара": "Самара",
                "Саранск": "Саранск",
                "Саратов": "Саратов",
                "Симферополь": "Симферополь",
                "Сочи": "Сочи",
                "Ставрополь": "Ставрополь",
                "Сургут": "Сургут",
                "Сыктывкар": "Сыктывкар",
                "Томск": "Томск",
                "Тюмень": "Тюмень",
                "Улан-Удэ": "Улан-Удэ",
                "Ульяновск": "Ульяновск",
                "Уфа": "Уфа",
                "Хабаровск": "Хабаровск",
                "Ханты-Мансийск": "Ханты-Мансийск",
                "Чебоксары": "Чебоксары",
                "Челябинск": "Челябинск",
                "Череповец": "Череповец",
                "Чита": "Чита",
                "Ю.Сахалинск": "Ю.Сахалинск",
                "Якутск": "Якутск",
                "Ярославль": "Ярославль"
            };
            def = "Москва";
        };

        if ($("select[name='departure_country']").val() == "BY") {
            data = {
                "Брест": "Брест",
                "Витебск": "Витебск",
                "Гомель": "Гомель",
                "Гродно": "Гродно",
                "Минск": "Минск",
                "Могилев": "Могилев",
            };
            def = "Минск";
        };

        if ($("select[name='departure_country']").val() == "KZ") {
            data = {
                "Актау": "Актау",
                "Актобе": "Актобе",
                "Алматы": "Алматы",
                "Атырау": "Атырау",
                "Караганды": "Караганды",
                "Костанай": "Костанай",
                "Кызылорда": "Кызылорда",
                "Нур-Султан": "Нур-Султан",
                "Павлодар": "Павлодар",
                "Петропавловск": "Петропавловск",
                "Тараз": "Тараз",
                "Уральск": "Уральск",
                "Усть-Каменогорск": "Усть-Каменогорск",
                "Шымкент": "Шымкент",
            };
            def = "Нур-Султан";
        };

        if ($("select[name='departure_country']").val() == "ANY") {
            data = {
                "Баку": "Баку",
                "Бишкек": "Бишкек",
                "Варшава": "Варшава",
                "Вильнюс": "Вильнюс",
                "Винница": "Винница",
                "Днепр": "Днепр",
                "Запорожье": "Запорожье",
                "Ивано-Франковск": "Ивано-Франковск",
                "Каунас": "Каунас",
                "Киев": "Киев",
                "Кривой Рог": "Кривой Рог",
                "Львов": "Львов",
                "Николаев": "Николаев",
                "Одесса": "Одесса",
                "Рига": "Рига",
                "Таллин": "Таллин",
                "Ташкент": "Ташкент",
                "Харьков": "Харьков",
                "Херсон": "Херсон",
                "Черновцы": "Черновцы",
            };
            def = "Киев";
        };

        for(var id in data) {
            if (id == def) {
                $("select[name='departure_city']").append($("<option selected value='" + id + "'>" + data[id] + "</option>"));
            } else {
                $("select[name='departure_city']").append($("<option value='" + id + "'>" + data[id] + "</option>"));
            };
        };
    });
});

