window.onload = function() {
        // console.log("Окно country загружено");
        if ($("select[name='departure_country']").val() == "RU") {

            data = {
                "Абакан": "Абакан",
                "Анапа": "Анапа",
                "Архангельск": "Архангельск",
                "Астрахань": "Астрахань",
                "Барнаул": "Барнаул",
                "Белгород": "Белгород",
                "Благовещенск": "Благовещенск",
                "Братск": "Братск",
                "Брянск": "Брянск",
                "Владивосток": "Владивосток",
                "Владикавказ": "Владикавказ",
                "Волгоград": "Волгоград",
                "Воронеж": "Воронеж",
                "Грозный": "Грозный",
                "Екатеринбург": "Екатеринбург",
                "Иваново": "Иваново",
                "Ижевск": "Ижевск",
                "Иркутск": "Иркутск",
                "Казань": "Казань",
                "Калининград": "Калининград",
                "Калуга": "Калуга",
                "Кемерово": "Кемерово",
                "Киров": "Киров",
                "Краснодар": "Краснодар",
                "Красноярск": "Красноярск",
                "Курск": "Курск",
                "Липецк": "Липецк",
                "Магнитогорск": "Магнитогорск",
                "Махачкала": "Махачкала",
                "Мин.Воды": "Мин.Воды",
                "Москва": "Москва",
                "Мурманск": "Мурманск",
                "Н.Новгород": "Н.Новгород",
                "Наб.Челны": "Наб.Челны",
                "Нальчик": "Нальчик",
                "Нижневартовск": "Нижневартовск",
                "Нижнекамск": "Нижнекамск",
                "Новокузнецк": "Новокузнецк",
                "Новосибирск": "Новосибирск",
                "Новый Уренгой": "Новый Уренгой",
                "Омск": "Омск",
                "Оренбург": "Оренбург",
                "Орск": "Орск",
                "П.Камчатский": "П.Камчатский",
                "Пенза": "Пенза",
                "Пермь": "Пермь",
                "Ростов-на-Дону": "Ростов-на-Дону",
                "С.Петербург": "С.Петербург",
                "Самара": "Самара",
                "Саранск": "Саранск",
                "Саратов": "Саратов",
                "Симферополь": "Симферополь",
                "Сочи": "Сочи",
                "Ставрополь": "Ставрополь",
                "Сургут": "Сургут",
                "Сыктывкар": "Сыктывкар",
                "Томск": "Томск",
                "Тюмень": "Тюмень",
                "Улан-Удэ": "Улан-Удэ",
                "Ульяновск": "Ульяновск",
                "Уфа": "Уфа",
                "Хабаровск": "Хабаровск",
                "Ханты-Мансийск": "Ханты-Мансийск",
                "Чебоксары": "Чебоксары",
                "Челябинск": "Челябинск",
                "Череповец": "Череповец",
                "Чита": "Чита",
                "Ю.Сахалинск": "Ю.Сахалинск",
                "Якутск": "Якутск",
                "Ярославль": "Ярославль",
            };
        };

        if ($("select[name='departure_country']").val() == "BY") {
            data = {
                "Брест": "Брест",
                "Витебск": "Витебск",
                "Гомель": "Гомель",
                "Гродно": "Гродно",
                "Минск": "Минск",
                "Могилев": "Могилев",
            };
        };

        if ($("select[name='departure_country']").val() == "KZ") {
            data = {
                "Актау": "Актау",
                "Актобе": "Актобе",
                "Алматы": "Алматы",
                "Атырау": "Атырау",
                "Караганды": "Караганды",
                "Костанай": "Костанай",
                "Кызылорда": "Кызылорда",
                "Нур-Султан": "Нур-Султан",
                "Павлодар": "Павлодар",
                "Петропавловск": "Петропавловск",
                "Тараз": "Тараз",
                "Уральск": "Уральск",
                "Усть-Каменогорск": "Усть-Каменогорск",
                "Шымкент": "Шымкент",
            };
        };

        if ($("select[name='departure_country']").val() == "ANY") {
            data = {
                "Баку": "Баку",
                "Бишкек": "Бишкек",
                "Варшава": "Варшава",
                "Вильнюс": "Вильнюс",
                "Винница": "Винница",
                "Днепр": "Днепр",
                "Запорожье": "Запорожье",
                "Ивано-Франковск": "Ивано-Франковск",
                "Каунас": "Каунас",
                "Киев": "Киев",
                "Кривой Рог": "Кривой Рог",
                "Львов": "Львов",
                "Николаев": "Николаев",
                "Одесса": "Одесса",
                "Рига": "Рига",
                "Таллин": "Таллин",
                "Ташкент": "Ташкент",
                "Харьков": "Харьков",
                "Херсон": "Херсон",
                "Черновцы": "Черновцы",
            };
        };

        def = $("select[name='departure_city']").val();
        $("select[name='departure_city']").empty();
        for(var id in data) {
            if (id == def) {
                $("select[name='departure_city']").append($("<option selected value='" + id + "'>" + data[id] + "</option>"));
            } else {
                $("select[name='departure_city']").append($("<option value='" + id + "'>" + data[id] + "</option>"));
            };
        };

        if ($("select[name='destination_country']").val() == "Сингапур") {
            data2 = {
                "Сингапур": "Сингапур",
            };
        };

        if ($("select[name='destination_country']").val() == "Таиланд") {
            data2 = {
                "Бангкок": "Бангкок",
                "Као Лак": "Као Лак",
                "Ко Чанг": "Ко Чанг",
                "Краби": "Краби",
                "Паттайя": "Паттайя",
                "Пхукет": "Пхукет",
                "Районг": "Районг",
                "Самуи": "Самуи",
                "Хуа Хин": "Хуа Хин",
                "Чианг Май": "Чианг Май",
            };
        };

        if ($("select[name='destination_country']").val() == "Турция") {
            data2 = {
                "Алания": "Алания",
                "Анталия": "Анталия",
                "Белек": "Белек",
                "Бодрум": "Бодрум",
                "Даламан": "Даламан",
                "Дидим": "Дидим",
                "Измир": "Измир",
                "Кайсери": "Кайсери",
                "Каппадокия": "Каппадокия",
                "Кемер": "Кемер",
                "Кушадасы": "Кушадасы",
                "Мармарис": "Мармарис",
                "Сиде": "Сиде",
                "Стамбул": "Стамбул",
                "Улудаг": "Улудаг",
                "Фетхие": "Фетхие",
                "Чешме": "Чешме",
                "Эрзурум": "Эрзурум",
            };
        };

        if ($("select[name='destination_country']").val() == "Филиппины") {
            data2 = {
                "Боракай": "Боракай",
                "Бохоль": "Бохоль",
                "Лусон": "Лусон",
                "Палаван": "Палаван",
                "Себу": "Себу",
            };
        };

        if ($("select[name='destination_country']").val() == "Япония") {
            data2 = {
                "Киото": "Киото",
                "Окинава": "Окинава",
                "Осака": "Осака",
                "Токио": "Токио",
            };
        };

        if ($("select[name='destination_country']").val() == "Тунис") {
            data2 = {
                "Гаммарт": "Гаммарт",
                "Джерба": "Джерба",
                "Махдия": "Махдия",
                "Монастир": "Монастир",
                "Сусс": "Сусс",
                "Табарка": "Табарка",
                "Хаммамет": "Хаммамет",
            };
        };

        def2 = $("select[name='destination_resort']").val();
        $("select[name='destination_resort']").empty();
        for(var id in data2) {
            if (id == def2) {
                $("select[name='destination_resort']").append($("<option selected value='" + id + "'>" + data2[id] + "</option>"));
            } else {
                $("select[name='destination_resort']").append($("<option value='" + id + "'>" + data2[id] + "</option>"));
            };
        };
    };
